{"backend": "tensorflow", "config": [{"config": {"units": 5, "name": "dense_1", "trainable": true, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "batch_input_shape": [null, 3], "activation": "relu"}, "class_name": "Dense"}, {"config": {"units": 5, "name": "dense_2", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"units": 5, "name": "dense_3", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"units": 1, "name": "dense_4", "trainable": true, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Dense"}], "keras_version": "2.1.2-tf", "class_name": "Sequential"}